## DEPENDECIES FOR ALL THE PROJECT

In [2]:
# General purpose
import os
from dotenv import load_dotenv

# Extract (Web Scraping)
from selenium import webdriver
from selenium.webdriver.common.by import By
from selenium.webdriver.chrome.service import Service
from webdriver_manager.chrome import ChromeDriverManager

# Transform & Load
import pandas as pd
import numpy as np
import sqlite3

# API
from flask import Flask, jsonify

# Visualize
import dash
from dash import dcc, html
import plotly.express as px

## STEP #1: EXTRACTION OF DATA FROM WEB WITH SELENIUM

In [3]:
# Setting up browser for Chrome
options = webdriver.ChromeOptions()

# Run Chrome in headless mode 
options.add_argument("--headless")  

# Launch Chrome using the options settings above
driver = webdriver.Chrome(service=Service(ChromeDriverManager().install()), options=options)

In [4]:
# Navigate browser to the bookscraping site
driver.get("https://books.toscrape.com/")

In [5]:
# Tell the browser to show us the title of the current page (to doubule check if loaded correctly)
print(driver.title)

All products | Books to Scrape - Sandbox

In [6]:
# Checking through the page and find all the books content (each book is inside an <article> tag with class 'product_pod')
books = driver.find_elements(By.CLASS_NAME, "product_pod")

In [7]:
# Let's count how many books we found on the page
print("Books found:", len(books))

Books found: 20

### SCRAPING PROCEDURE

In [8]:
# Let's grab the title of the first book on the page
first_title = books[0].find_element(By.TAG_NAME, "h3").find_element(By.TAG_NAME, "a").get_attribute("title")

# Show the title of the first book to confirm we got it right
print("First book title:", first_title)

First book title: A Light in the Attic

In [9]:
# Now let's get the price of the first book
first_price = books[0].find_element(By.CLASS_NAME, "price_color").text

# Show the price of the first book to confirm we got it right
print("First book price:", first_price)

First book price: £51.77

In [10]:
# Let's check if the first book is available (in stock or not)
first_availability = books[0].find_element(By.CLASS_NAME, "availability").text.strip()

# Show the availability of the first book to confirm we got it right
print("First book availability:", first_availability)

First book availability: In stock

In [11]:
# Let's get the rating of the first book (like 'Three', 'Four', etc.)
first_rating = books[0].find_element(By.CLASS_NAME, "star-rating").get_attribute("class").split()[-1]

# Show the rating of the first book to confirm we got it right
print("First book rating:", first_rating)

First book rating: Three

In [12]:
[
  {'title': '...', 'price': '...', 'availability': '...', 'rating': '...'},
  ...
]

[{'title': '...', 'price': '...', 'availability': '...', 'rating': '...'},
 Ellipsis]

In [13]:
# Create a list to hold all the book data
book_data = []

In [14]:
# Go through each book found on the page, one by one
for book in books:
	title = book.find_element(By.TAG_NAME, "h3").find_element(By.TAG_NAME, "a").get_attribute("title")
	price = book.find_element(By.CLASS_NAME, "price_color").text
	availability = book.find_element(By.CLASS_NAME, "availability").text.strip()
	rating = book.find_element(By.CLASS_NAME, "star-rating").get_attribute("class").split()[-1]
	book_data.append({
		'title': title,
		'price': price,
		'availability': availability,
		'rating': rating
	})

In [15]:
# Show the first 3 books collected to preview the results
print(book_data[:3])

[{'title': 'A Light in the Attic', 'price': '£51.77', 'availability': 'In stock', 'rating': 'Three'}, {'title': 'Tipping the Velvet', 'price': '£53.74', 'availability': 'In stock', 'rating': 'One'}, {'title': 'Soumission', 'price': '£50.10', 'availability': 'In stock', 'rating': 'One'}]

## STEP #2: TRANSFORM

In [16]:
# Convert the list of book data into a DataFrame for easier manipulation
df = pd.DataFrame(book_data)

In [17]:
# Visualizing the dataframe 
df.head()

                                   title   price availability rating
0                   A Light in the Attic  £51.77     In stock  Three
1                     Tipping the Velvet  £53.74     In stock    One
2                             Soumission  £50.10     In stock    One
3                          Sharp Objects  £47.82     In stock   Four
4  Sapiens: A Brief History of Humankind  £54.23     In stock   Five

In [18]:
# Removing the '£' symbol and convert the price column to float
df['price'] = df['price'].str.replace('£', '').astype(float)

In [19]:
# Verifying the changes without the '£' symbol
df.head()

                                   title  price availability rating
0                   A Light in the Attic  51.77     In stock  Three
1                     Tipping the Velvet  53.74     In stock    One
2                             Soumission  50.10     In stock    One
3                          Sharp Objects  47.82     In stock   Four
4  Sapiens: A Brief History of Humankind  54.23     In stock   Five

In [20]:
# Convert the rating words (e.g. 'Three') into numbers (e.g. 3.0)
rating_map = {'One': 1, 'Two': 2, 'Three': 3, 'Four': 4, 'Five': 5}
df['rating'] = df['rating'].map(rating_map).astype(float)

In [21]:
# Create a new column converting GBP to USD using a fixed exchange rate
exchange_rate = 1.28
df['price_usd'] = df['price'] * exchange_rate

In [22]:
# Show the updated DataFrame with the new USD prices
df.head()

,title,price,availability,rating,price_usd
0,A Light in the Attic,51.77,In stock,3.0,66.2656
1,Tipping the Velvet,53.74,In stock,1.0,68.7872
2,Soumission,50.10,In stock,1.0,64.1280
3,Sharp Objects,47.82,In stock,4.0,61.2096
4,Sapiens: A Brief History of Humankind,54.23,In stock,5.0,69.4144

In [23]:
# Modifying the column "price" for "price_gbp"
df.rename(columns={'price': 'price_gbp'}, inplace=True)

In [24]:
# Changing the column "availability" to "in_stock"
df.rename(columns={'availability': 'in_stock'}, inplace=True)

In [25]:
# Moving column "price_gbp" to the end of the DataFrame
df = df[['title', 'in_stock', 'rating', 'price_gbp', 'price_usd']]

In [26]:
# Verying the changes of column name "price" for "price_gbp", the position of the column, columns names and the data types
df.head()

,title,in_stock,rating,price_gbp,price_usd
0,A Light in the Attic,In stock,3.0,51.77,66.2656
1,Tipping the Velvet,In stock,1.0,53.74,68.7872
2,Soumission,In stock,1.0,50.10,64.1280
3,Sharp Objects,In stock,4.0,47.82,61.2096
4,Sapiens: A Brief History of Humankind,In stock,5.0,54.23,69.4144

## STEP 3: LOAD THE DATA INTO SQLITE & GET A CSV FILE

In [27]:
# Load the DataFrame into a SQLite database
conn = sqlite3.connect('books.db')

In [28]:
# Write the DataFrame to a table named 'books' in the SQLite database
df.to_sql('books', conn, if_exists='replace', index=False)

20

In [ ]:
# Export the cleaned DataFrame to a CSV file with condintional to avoid duplicateds

if not os.path.exists("books_cleaned.csv"):
    df.to_csv("books_cleaned.csv", index=False)